"""
Представлен список чисел. Необходимо вывести элементы исходного списка, значения
которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для его
формирования используйте генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
"""

list_1 = (input("Введите числа: ")).split()
list_1 = [int(el) for el in list_1]
list_2 = [el for el in list_1 if list_1[el] < list_1[el+1]]

print(list_1)
print(list_2)